In [1]:
from selenium import webdriver
from webdriver_manager.chrome import ChromeDriverManager 
import pandas as pd
from selenium.webdriver.common.by import By

In [2]:
url = 'https://tradingeconomics.com/country-list/rating'

In [3]:
PATH = ChromeDriverManager().install()     # instala el driver de chrome

driver=webdriver.Chrome(PATH)       # abre una venta una de chrome

driver.get(url)

C:\Users\axell\AppData\Local\Temp\ipykernel_100\2183069208.py:3: DeprecationWarning: executable_path has been deprecated, please pass in a Service object
  driver=webdriver.Chrome(PATH)       # abre una venta una de chrome

In [4]:
SnP =  [e.text for e in driver.find_elements(By.XPATH, '//td[@align="left"]')]

In [5]:
Name = SnP[::3]

In [6]:
RatingSnP = SnP[1::3]

In [7]:
TE = SnP[2::3]

In [8]:
ratings = pd.DataFrame(Name)
ratings['Rating_S&P'] = RatingSnP
ratings['Trading_Economics'] = TE
ratings['id_Name'] = [e for e in range (len ( TE))]

In [9]:
ratings.columns = ['Name', 'Rating_S&P', 'Trading_Economics','id_Rating']

In [10]:
IMF = pd.read_csv('Data\Scrach Data\IMF_DF.csv')

In [11]:
df = IMF.merge(ratings[['Name','id_Rating']], on='Name', how='left')

In [12]:
index = df[df['id_Rating'].isnull()==True].index

In [13]:
nr = df.Name.iloc[index].unique()

In [14]:
for e in nr:
    Name.append(e)
ratings = pd.DataFrame(Name)

In [15]:
ratings.columns = ['Name']
ratings

                                 Name
0                             Albania
1                             Andorra
2                              Angola
3                           Argentina
4                             Armenia
..                                ...
177                           Somalia
178                       Saint Lucia
179  Saint Vincent and the Grenadines
180                             Sudan
181                          Zimbabwe

[182 rows x 1 columns]

In [16]:
RatingSnP = RatingSnP + ['nr' for e in range(len(RatingSnP), len(Name))]
ratings['Rating_S&P'] = RatingSnP

In [17]:
ratings.head()

        Name Rating_S&P
0    Albania         B+
1    Andorra       BBB+
2     Angola         B-
3  Argentina       CCC+
4    Armenia         B+

In [18]:
TE = TE + ['nr' for e in range(len(TE), len(Name))]
ratings['Trading_Economics'] = TE

In [19]:
ratings.head()

        Name Rating_S&P Trading_Economics
0    Albania         B+                35
1    Andorra       BBB+                63
2     Angola         B-                25
3  Argentina       CCC+                15
4    Armenia         B+                14

In [20]:
ratings['id_Rating'] = [e for e in range (len ( Name))]

In [21]:
ratings.head()

        Name Rating_S&P Trading_Economics  id_Rating
0    Albania         B+                35          0
1    Andorra       BBB+                63          1
2     Angola         B-                25          2
3  Argentina       CCC+                15          3
4    Armenia         B+                14          4

In [22]:
IMF = IMF.iloc[:,2:-1]

In [23]:
ratings

                                 Name Rating_S&P Trading_Economics  id_Rating
0                             Albania         B+                35          0
1                             Andorra       BBB+                63          1
2                              Angola         B-                25          2
3                           Argentina       CCC+                15          3
4                             Armenia         B+                14          4
..                                ...        ...               ...        ...
177                           Somalia         nr                nr        177
178                       Saint Lucia         nr                nr        178
179  Saint Vincent and the Grenadines         nr                nr        179
180                             Sudan         nr                nr        180
181                          Zimbabwe         nr                nr        181

[182 rows x 4 columns]

In [24]:
df = IMF.merge(ratings[['Name','id_Rating']], on='Name', how='right')

In [25]:
index = df[df.id_Name.isnull() == True].index

In [26]:
df.drop(index, inplace = True )

In [27]:
df.reset_index(drop = True, inplace = True)

In [28]:
df.to_csv('Data\Final Data\Final_IMF.csv')

In [29]:
ratings.to_csv('Data\Final Data\Ratings.csv')